<a href="https://colab.research.google.com/github/kaindoh/SQL/blob/master/SQL_Programming_Getting_Started_with_Databases.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [13]:
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @None'

In [14]:
%%sql
CREATE TABLE if not exists PC(
    code text,
    model varchar(255),
    speed varchar(255),
    RAM varchar(255),
    CD varchar(255),
    price int
    
);
SELECT * from PC;

 * sqlite://
Done.
Done.

[]

# printer

In [15]:
%%sql
CREATE TABLE if not exists printer(
    code varchar(255),
    model varchar(255),
    speed varchar(255),
    type varchar(255), 
    price int
    
);
SELECT * from printer;

 * sqlite://
Done.
Done.

[]

# movies

In [16]:
%%sql
CREATE TABLE if not exists movies(
    id int,
    title varchar(255),
    director varchar(255),
    year year,
    length_minutes time

);
SELECT * from movies;

 * sqlite://
Done.
Done.

[]

# specifying column data types

In [17]:
%%sql
CREATE TABLE if not exists customer(
    custID int,
    lastName char(25),
    firstName char(20)
    

);
SELECT * from customer;

 * sqlite://
Done.
Done.

[]

In [18]:
%%sql
CREATE TABLE if not exists sales(
    salesID integer,
    customerID int,
    name varchar(255),
    address varchar(255)
    

);
SELECT * from sales;

 * sqlite://
Done.
Done.

[]

In [19]:
%%sql
CREATE TABLE if not exists employees(
    employee_no int,
    employee_name varchar(255),
    department varchar(255),
    salary_infor float
);
SELECT * from employees;

 * sqlite://
Done.
Done.

[]

# specifying column default values

In [20]:
%%sql
CREATE TABLE if not exists latest_players(
    player_Id int PRIMARY KEY,
    player_name varchar(255),
    age int DEFAULT 'unknown',
    height REAL
    

);
SELECT * from latest_players;

 * sqlite://
Done.
Done.

[]

In [21]:
%%sql
CREATE TABLE if not exists restuarant(
    name varchar(255),
    description text,
    address varchar(255) DEFAULT 'unknown',
    user_Id int PRIMARY KEY,
    last_orders_at date

);
SELECT * from restuarant;

 * sqlite://
Done.
Done.

[]

#altering sql tables

In [22]:
%%sql
CREATE TABLE if not exists teamMembers(
    id int PRIMARY KEY,
    name varchar(255),
    age int DEFAULT 'unknown',
    height REAL

);
SELECT * from teamMembers;

 * sqlite://
Done.
Done.

[]

In [23]:
%%sql
ALTER TABLE teamMembers ADD DOB date;
SELECT * from teamMembers;

 * sqlite://
Done.
Done.

[]

In [24]:
%%sql
PRAGMA table_info(teamMembers);

 * sqlite://
Done.

[(0, 'id', 'int', 0, None, 1),
 (1, 'name', 'varchar(255)', 0, None, 0),
 (2, 'age', 'int', 0, "'unknown'", 0),
 (3, 'height', 'REAL', 0, None, 0),
 (4, 'DOB', 'date', 0, None, 0)]

In [25]:
%%sql
CREATE TABLE Artists(
    artist_id int,
    artist_name varchar(60),
    place_of_birth varchar(60)
    

);

 * sqlite://
Done.

[]

In [26]:
%%sql
ALTER TABLE Artists ADD STUDIO text;
SELECT * from Artists;

 * sqlite://
Done.
Done.

[]

In [33]:
%%sql
ALTER TABLE Artists RENAME TO MusicArtist;

 * sqlite://
Done.

[]

In [34]:
%%sql
ALTER TABLE MusicArtist DROP COLUMN place_of_birth;
SELECT * from MusicArtists;

 * sqlite://
(sqlite3.OperationalError) near "DROP": syntax error
[SQL: ALTER TABLE MusicArtist DROP COLUMN place_of_birth;]
(Background on this error at: http://sqlalche.me/e/e3q8)

# dropping sql tables

In [29]:

%sql DROP TABLE latest_players;

 * sqlite://
Done.

[]

In [30]:
%%sql
DELETE FROM movies;

 * sqlite://
0 rows affected.

[]

In [31]:
%sql DROP TABLE Customer;

 * sqlite://
Done.

[]